# FitToModel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..FitToModel Method
SunAndShadowSettings Class See Also
---
Adjust SunAndShadowSettings to fit around the current model geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void FitToModel()
```

Visual Basic
---
```text
Public Sub FitToModel
```

Visual C++
---
```text
public:
void FitToModel()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The SunAndShadowSettings is not view-specific. |

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace